ShawnFeng0/qemu_stm32_rtos_example/include/utos/debug_log.h
//
// Created by shawnfeng on 2021/11/7.
//

#include <inttypes.h>
#include <stdio.h>
#include <string.h>

#include "common.h"
#include "stm32f407xx.h"
#include "tick.h"

static inline void PrintDebugStr(const char *str) {
  if (!str) return;

  utos::internal::IrqLockGuard irq_lock_guard;
  while (*str) {
    ITM_SendChar(*str++);
  }
}

// Precompiler define to get only filename;
#if !defined(__FILENAME__)
#define __FILENAME__                                       \
  (strrchr(__FILE__, '/')    ? strrchr(__FILE__, '/') + 1  \
   : strrchr(__FILE__, '\\') ? strrchr(__FILE__, '\\') + 1 \
                             : __FILE__)
#endif

#define LOGGER_LEVEL_TRACE "T"
#define LOGGER_LEVEL_DEBUG "D"
#define LOGGER_LEVEL_INFO "I"
#define LOGGER_LEVEL_WARN "W"
#define LOGGER_LEVEL_ERROR "E"
#define LOGGER_LEVEL_FATAL "F"

#define LOGGER_RESET_COLOR "\x1b[0m"
#define LOGGER_TRACE_COLOR "\x1b[37m"
#define LOGGER_DEBUG_COLOR "\x1b[34m"
#define LOGGER_INFO_COLOR "\x1b[32m"
#define LOGGER_WARN_COLOR "\x1b[33m"
#define LOGGER_ERROR_COLOR "\x1b[31m"
#define LOGGER_FATAL_COLOR "\x1b[35m"

#define LOGGER_OUT(level, fmt, ...)                                      \
  do {                                                                   \
    char buffer[256];                                                    \
    snprintf(buffer, sizeof(buffer),                                     \
             "%s%.3f %s/(%s:%d %s) %s" fmt LOGGER_RESET_COLOR "\r\n",    \
             LOGGER_RESET_COLOR, utos::time::get_time_ms() / 1000.f,     \
             LOGGER_LEVEL_##level, __FILENAME__, __LINE__, __FUNCTION__, \
             LOGGER_##level##_COLOR, ##__VA_ARGS__);                     \
    PrintDebugStr(buffer);                                               \
  } while (0)

#define LOGGER_TRACE(fmt, ...) LOGGER_OUT(TRACE, fmt, ##__VA_ARGS__)
#define LOGGER_DEBUG(fmt, ...) LOGGER_OUT(DEBUG, fmt, ##__VA_ARGS__)
#define LOGGER_INFO(fmt, ...) LOGGER_OUT(INFO, fmt, ##__VA_ARGS__)
#define LOGGER_WARN(fmt, ...) LOGGER_OUT(WARN, fmt, ##__VA_ARGS__)
#define LOGGER_ERROR(fmt, ...) LOGGER_OUT(ERROR, fmt, ##__VA_ARGS__)
#define LOGGER_FATAL(fmt, ...) LOGGER_OUT(FATAL, fmt, ##__VA_ARGS__)
